<a href="https://colab.research.google.com/github/diflores/ayudantia-2-iic1005-2019-2/blob/master/Ayudantia_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# IIC1005: Ayudantía 2

#### 21 de agosto de 2019.

###### Esta ayudantía está inspirada en la Ayudantía 2 de la versión 2017-2 de este curso. Puedes encontrar la original [aquí](https://github.com/diflores/iic1005-ayudantia-2).

## *Jupyter notebooks*

**¿Qué es un *notebook*?**

Un *notebook* es un documento generado por la *Jupyter Notebook App*. Estos documentos contienen código ejecutable y también elementos más amigables para el ser humano común, tales como párrafos, ecuaciones e hipervínculos. Estas características convierten a los *notebooks* en herramientas ideales para aprender Python, procesar datos y aventurarse *machine learning*.

Los *notebooks* se componen de una serie de celdas, que pueden ser de distintos tipos. Por lo general, utilizaremos solo dos:

- Code (para escribir código ejecutable).
- [*Markdown*](https://guides.github.com/features/mastering-markdown/) (para escribir párrafos en dicho lenguage de marcación).

La celda actual es una celda de tipo *markdown*. La siguiente, corresponde a una de tipo *code*. Puedes ejecutar su código presionando el ícono ▶️:

In [1]:
print("¡Hola mundo!")

¡Hola mundo!

También puedes ejecutar el código de una celda presionando shift + enter, lo que ejecutará el código y avanzará a la celda siguiente. Si deseas ejecutar el código, pero mantenerte en la celda correspondiente, utiliza ctrl + enter. Si quieres aprender más atajos de teclado, presiona esc + h

## Pandas

**¿Qué es pandas?**

Pandas es una librería de Python que nos permitirá manipular datos de manera sencilla.

**¿Por qué no utilizamos las estructuras de datos de Python para esto?**

Porque aun cuando sirvan para solucionar el problema, su uso en esta misión no es eficiente. 

### Conceptos básicos de pandas: *Series* y *DataFrames*

Pandas cuenta con dos estructuras de datos principales, las *Series* y los *DataFrames*. Una Series puede ser comprendida como una columna de datos. Un *DataFrame*, por su parte, puede ser visto como un conjunto de *Series*.

A continuación, revisaremos un ejemplo sencillo, que nos permitirá introducirnos al uso de pandas. Lo primero que debemos hacer es importar la librería:

In [0]:
import pandas as pd

En este ejemplo, utilizaremos un *dataset* de transacciones de enero de 2009, el que fue obtenido desde [aquí](https://support.spatialkey.com/spatialkey-sample-csv-data/). Lo primero que debemos hacer es cargar los datos. Para ello, la librería pandas provee un método muy útil llamado `read_csv`.

In [3]:
!wget -O SalesJan2009.csv https://gist.githubusercontent.com/diflores/e11af543eb64090d2446f231f2e84f0f/raw/9ed83fae10d41e823e7c5b2aa2f77756f7d9933a/SalesJan2009.csv

--2019-08-21 21:39:23--  https://gist.githubusercontent.com/diflores/e11af543eb64090d2446f231f2e84f0f/raw/9ed83fae10d41e823e7c5b2aa2f77756f7d9933a/SalesJan2009.csv
Resolving gist.githubusercontent.com (gist.githubusercontent.com)... 151.101.0.133, 151.101.64.133, 151.101.128.133, ...
Connecting to gist.githubusercontent.com (gist.githubusercontent.com)|151.101.0.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 123634 (121K) [text/plain]
Saving to: ‘SalesJan2009.csv’

SalesJan2009.csv    100%[===================>] 120.74K  --.-KB/s    in 0.02s

2019-08-21 21:39:23 (5.28 MB/s) - ‘SalesJan2009.csv’ saved [123634/123634]

In [0]:
dataset = pd.read_csv("SalesJan2009.csv")

### Explorando los datos mediante preguntas *interesantes*
Antes de manipular los datos, es conveniente explorarlos. Inicialmente, podríamos preguntarnos: ¿qué columnas contiene el *dataset* recién cargado? Podemos obtener esta información ejecutando la siguiente celda:

In [5]:
dataset.columns

Index(['Transaction_date', 'Product', 'Price', 'Payment_Type', 'Name', 'City',
       'State', 'Country', 'Account_Created', 'Last_Login', 'Latitude',
       'Longitude'],
      dtype='object')

**¿Cuántas filas tiene el *dataset*?**

In [6]:
len(dataset)

998

**¿Cómo se ve el *dataset*?**

In [7]:
dataset.sample(10)

    Transaction_date   Product  Price  ...     Last_Login   Latitude   Longitude
242     1/23/09 3:30  Product1   1200  ...   1/23/09 3:40  52.300000    5.150000
848      1/2/09 8:31  Product1   1200  ...   2/22/09 7:06  47.450000   18.966667
96     1/14/09 19:32  Product1   1200  ...  1/14/09 19:28  25.773890  -80.193890
843    1/29/09 21:40  Product1   1200  ...  2/21/09 20:32  49.250000 -123.133333
632    1/14/09 12:55  Product1   1200  ...   2/11/09 1:58  47.433333    8.466667
121     1/16/09 7:21  Product1   2100  ...   1/16/09 6:08  41.372220  -73.733890
140     1/18/09 5:27  Product1   1200  ...   1/18/09 4:42  33.940000 -118.131670
616     1/21/09 4:46  Product1   1200  ...  2/10/09 12:22  55.766667   12.600000
149     1/18/09 4:38  Product1   1200  ...  1/18/09 11:58  54.650000   -1.666667
680     1/8/09 20:52  Product1   1200  ...  2/13/09 19:32  33.888610 -117.812220

[10 rows x 12 columns]

Pandas también nos permite responder preguntas un poco más interesantes como:

**¿Cuáles son las transacciones que fueron realizadas en Noruega?**

In [8]:
dataset[dataset["Country"] == "Norway"]

    Transaction_date   Product  Price  ...     Last_Login   Latitude  Longitude
67     1/11/09 11:33  Product1   1200  ...  1/12/09 10:37  58.966667   5.750000
79      1/8/09 13:14  Product1   1200  ...  1/13/09 10:49  59.916667  10.750000
168      1/7/09 8:21  Product1   1200  ...   1/19/09 6:54  59.966667  10.666667
213    1/21/09 11:36  Product1   1200  ...  1/21/09 13:47  59.916667  10.750000
234     1/1/09 14:22  Product1   1200  ...  1/22/09 14:38  58.966667   5.750000
262     1/10/09 3:28  Product1   1200  ...  1/24/09 15:10  59.413611  10.466944
343    1/15/09 10:51  Product1   1200  ...  1/28/09 10:39  58.883333   5.600000
387    1/11/09 14:56  Product1   1200  ...   1/31/09 4:21  61.550000   6.350000
408     1/9/09 16:35  Product1   1200  ...    2/1/09 4:18  59.860833  10.790556
429      1/6/09 3:39  Product1   1200  ...    2/2/09 0:08  60.391111   5.324722
608     1/13/09 9:14  Product1   1200  ...   2/10/09 9:04  60.633333   6.433333
683     1/28/09 4:35  Product1   1200  ...  2/13/09 23:15  59.916667  10.750000
831     1/25/09 8:16  Product2   3600  ...  2/20/09 23:22  59.916667  10.750000
897    1/19/09 10:47  Product1   1200  ...   2/25/09 0:40  58.966667   5.750000
909    1/22/09 12:56  Product1   1200  ...  2/25/09 12:03  59.348889  10.467500
925      1/2/09 4:21  Product1   1200  ...   2/26/09 3:18  59.816667  10.250000

[16 rows x 12 columns]

**¿Cuáles son las transacciones que fueron realizadas con una tarjeta Visa en los Países Bajos?**

In [9]:
dataset[(dataset["Country"] == "Netherlands") & (dataset["Payment_Type"] == "Visa")]

    Transaction_date   Product  Price  ...     Last_Login   Latitude Longitude
224    1/21/09 14:25  Product1   1200  ...   1/22/09 0:38  52.550000  4.666667
660    1/27/09 12:47  Product1   1200  ...  2/12/09 12:59  52.350000  4.916667
712    1/19/09 15:40  Product2   3600  ...  2/15/09 10:33  52.033333  5.666667
841    1/30/09 23:49  Product2   3600  ...  2/21/09 14:05  52.233333  5.183333

[4 rows x 12 columns]

La librería pandas nos permite resolver preguntas aun más interesantes, tales como **¿cuáles son los países con la mayor cantidad de transacciones?**. Para contestar esto, haremos uso de `group_by`, que, en palabras sencillas, nos permite agrupar las filas de un DataFrame de acuerdo a alguna(s) columna(s).

In [10]:
dataset.groupby(["Country"]).count()["Transaction_date"].sort_values(ascending=False)[0:4]

Country
United States     463
United Kingdom    100
Canada             76
Ireland            49
Name: Transaction_date, dtype: int64

Ahora queremos saber cuánto dinero fue transado por cada medio de pago:

In [11]:
dataset.groupby(["Payment_Type"])["Price"].sum()

Payment_Type
Amex          188900
Diners        133800
Mastercard    458450
Visa          849350
Name: Price, dtype: int64

#### Propuesto: ¿Cuál fue el producto más vendido dentro de Estados Unidos?

In [12]:
# Escribe tu solución aquí
dataset[dataset["Country"] == "United States"]["Product"].value_counts()

Product1     400
Product2      55
Product3       7
Product3       1
Name: Product, dtype: int64

El retorno de la celda anterior debería verse más o menos así:

### Agregando información al dataset

Queremos agregar una columna que indique cuán satisfecho quedó el cliente con su transacción. La medida de satisfacción que utilizaremos será una nota de 1 a 5. Primero definimos una función que entregue $n$ *ratings* aleatorios.

In [0]:
import random

def random_ratings(number):
    ratings = []
    for i in range(number):
        rating = random.choice(range(1,6))
        ratings.append(rating)
    return ratings

Ahora agregamos la columna de ratings de la siguiente manera:

In [0]:
ratings = random_ratings(len(dataset))
dataset["Rating"] = ratings

Revisemos si efectivamente se añadió la columna:

In [15]:
dataset.sample(5)

    Transaction_date   Product  Price  ...  Latitude  Longitude Rating
851    1/25/09 20:15  Product1   1200  ...  41.22190  -73.88700      2
407      1/3/09 9:58  Product1   1200  ...  38.79556  -77.61417      5
313     1/27/09 2:26  Product1   1200  ...  33.15667  -94.96806      4
304    1/24/09 18:43  Product1   1200  ...  33.76444 -117.79306      1
35       1/6/09 7:46  Product1   1200  ...  38.96861  -77.34139      2

[5 rows x 13 columns]

Imaginemos que queremos cambiar los números de rating 1-5 a algo más descriptivo:

- 1: Very Dissatisfied.
- 2: Somewhat Dissatisfied.
- 3: Neither Satisfied Nor Dissatisfied.
- 4: Somewhat Satisfied.
- 5: Very Satisfied.

¿Cómo lo hacemos? El método `apply` nos ayudará mucho.

En primer lugar, conviene definir una función que dado un *rating* numérico, retorne la medida de satisfacción en palabras:

In [0]:
def convert(rating):
    if rating == 1:
        return "Very Dissatisfied"
    elif rating == 2:
        return "Somewhat Dissatisfied"
    elif rating == 3:
        return "Neither Satisfied Nor Dissatisfied"
    elif rating == 4:
        return "Somewhat Satisfied"
    else:
        return "Very Satisfied"

Posteriormente, aplicamos la función a la columna *Ratings*:

In [0]:
dataset["Rating"] = dataset["Rating"].apply(convert)

Veamos cómo quedó el dataset:

In [18]:
dataset.head()

  Transaction_date   Product  ...   Longitude                 Rating
0      1/2/09 6:17  Product1  ...   -1.116667      Very Dissatisfied
1      1/2/09 4:53  Product1  ...  -94.681940     Somewhat Satisfied
2     1/2/09 13:08  Product1  ... -123.830000  Somewhat Dissatisfied
3     1/3/09 14:44  Product1  ...  144.750000      Very Dissatisfied
4     1/4/09 12:56  Product2  ...  -86.802500     Somewhat Satisfied

[5 rows x 13 columns]

Esto ha sido solo una pequeña introducción a pandas. Es muy posible que en tu tarea debas emplear algunas cosas que no vimos en esta ayudantía, por lo que deberás investigar por tu cuenta. Recuerda que ante cualquier duda, los ayudantes estamos a tu completa disposición.